Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_usbd.c
/*********************************************************************************************************//**
 * @file    ht32f175x_275x_usbd.c
 * @version V1.0
 * @date    01/15/2013
 * @brief   The HT32F175x/275x USB Device Peripheral Driver.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2013 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f175x_275x_usbd.h"
#include "ht32f175x_275x_rstcu.h"

/** @addtogroup HT32F175x_275x_Peripheral_Driver HT32F175x/275x Peripheral Driver
  * @{
  */

/** @defgroup USBDevice USBDevice
  * @brief USB Device driver modules
  * @{
  */

/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_Constant USB Device private constants
  * @{
  */

#define TCR_MASK                    (0x1FF)
#define EPLEN_MASK                  ((u32)0x000FFC00)
#define EPBUFA_MASK                 ((u32)0x000003FF)
#define ISR_EPn_OFFSET              (8)

/* USB Control and Status Register (USBCSR)                                                                 */
#define FRES                        ((u32)0x00000002)   /* Force USB Reset                                  */
#define PDWN                        ((u32)0x00000004)   /* Power Down                                       */
#define LPMODE                      ((u32)0x00000008)   /* Low-power Mode                                   */
#define GENRSM                      ((u32)0x00000020)   /* Generate Resume                                  */
#define ADRSET                      ((u32)0x00000100)   /* Device Address Setting                           */

#define EPDIR_IN                    (1)
#define EPDIR_OUT                   (0)
/**
  * @}
  */
/* End of USBDevice_Private_Constant group                                                                  */

/* Private typedef -----------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_TypesDefinitions USB Device private types definitions
  * @{
  */

/**
  * @}
  */
/* End of USBDevice_Private_TypesDefinitions group                                                          */

/* Global variables ----------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Global_Variable USB Device global variables
  * @{
  */

/**
  * @}
  */
/* End of USBDevice_Global_Variable group                                                                   */

/* Private variables ---------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_Variable USB Device private variables
  * @{
  */
static u32 gIsFirstPowered = TRUE;
/**
  * @}
  */
/* End of USBDevice_Private_Variable group                                                                  */

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_Macro USB Device private macros
  * @{
  */
/**
 * @brief Convert Byte length to Word length
 */
#define ByteLen2WordLen(n)      ((n + 3) >> 2)
/**
  * @}
  */
/* End of USBDevice_Private_Macro group                                                                     */

/* Private function prototypes -----------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_Function_Prototype USB Device private function prototypes
  * @{
  */
static void _USBD_CopyMemory(u32 *pFrom, u32 *pTo, u32 len);
static USBEP_TypeDef * _USBD_GetEPTnAddr(USBD_EPTn_Enum EPTn);
/**
  * @}
  */
/* End of USBDevice_Private_Function_Prototype group                                                        */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup USBDDevice_Global_Function USBD Device global functions
  * @{
  */

/*********************************************************************************************************//**
  * @brief  Pre initialization for USBD_Init function.
  * @param  pDriver: USB initialization structure
  * @retval None
  ***********************************************************************************************************/
void USBD_PreInit(USBD_Driver_TypeDef *pDriver)
{
  pDriver->uInterruptMask = _UIER;

  pDriver->ept[USBD_EPT0].CFGR.word = _EP0_CFG;
  pDriver->ept[USBD_EPT0].IER       = _EP0_IER;

  #if (_EP1_ENABLE == 1)
  pDriver->ept[USBD_EPT1].CFGR.word = _EP1_CFG;
  pDriver->ept[USBD_EPT1].IER       = _EP1_IER;
  #endif

  #if (_EP2_ENABLE == 1)
  pDriver->ept[USBD_EPT2].CFGR.word = _EP2_CFG;
  pDriver->ept[USBD_EPT2].IER       = _EP2_IER;
  #endif

  #if (_EP3_ENABLE == 1)
  pDriver->ept[USBD_EPT3].CFGR.word = _EP3_CFG;
  pDriver->ept[USBD_EPT3].IER       = _EP3_IER;
  #endif

  #if (_EP4_ENABLE == 1)
  pDriver->ept[USBD_EPT4].CFGR.word = _EP4_CFG;
  pDriver->ept[USBD_EPT4].IER       = _EP4_IER;
  #endif

  #if (_EP5_ENABLE == 1)
  pDriver->ept[USBD_EPT5].CFGR.word = _EP5_CFG;
  pDriver->ept[USBD_EPT5].IER       = _EP5_IER;
  #endif

  #if (_EP6_ENABLE == 1)
  pDriver->ept[USBD_EPT6].CFGR.word = _EP6_CFG;
  pDriver->ept[USBD_EPT6].IER       = _EP6_IER;
  #endif

  #if (_EP7_ENABLE == 1)
  pDriver->ept[USBD_EPT7].CFGR.word = _EP7_CFG;
  pDriver->ept[USBD_EPT7].IER       = _EP7_IER;
  #endif

  return;
}

/*********************************************************************************************************//**
  * @brief  USB Device Peripheral initialization.
  * @param  pDriver: USB initialization structure
  * @retval None
  ***********************************************************************************************************/
void USBD_Init(u32 *pDriver)
{
  USBD_Driver_TypeDef *pDrv = (USBD_Driver_TypeDef *)pDriver;

  /* Init USB Device Driver struct                                                                          */
  USBD_PreInit(pDrv);

  /* Enable USB function                                                                                    */
  USBD_PowerOn();

  return;
}

