Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_usbd.c
/*********************************************************************************************************//**
  * @brief  USB Device Peripheral deinitialization.
  * @retval None
  ***********************************************************************************************************/
void USBD_DeInit(void)
{
  RSTCU_APBPerip1Reset(RSTCU_APBRST1_USB, ENABLE);
  return;
}

/*********************************************************************************************************//**
  * @brief  USB power up procedure.
  * @retval None
  ***********************************************************************************************************/
void USBD_PowerUp(u32 *pDriver)
{
  USBD_Driver_TypeDef *pDrv = (USBD_Driver_TypeDef *)pDriver;

  if (gIsFirstPowered == TRUE)
  {
    gIsFirstPowered = FALSE;
    USB->CSR = 0x2;
    USB->CSR = (LPMODE | PDWN);
    USB->ISR = 0xFFFFFFFF;
    PWRCU_DeepSleep1(PWRCU_SLEEP_ENTRY_WFE);
    USBD_EnableINT(pDrv->uInterruptMask);
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Enter USB Device Power Down mode.
  * @retval None
  ***********************************************************************************************************/
void USBD_PowerOff(void)
{
  USB->CSR = (LPMODE | PDWN);
  return;
}

/*********************************************************************************************************//**
  * @brief  Exit USB Device Power Down mode.
  * @retval None
  ***********************************************************************************************************/
void USBD_PowerOn(void)
{
  USB->CSR = 0x00000000;
  return;
}

/*********************************************************************************************************//**
  * @brief  Generate a resume request to USB Host for Remote Wakeup function.
  * @retval None
  ***********************************************************************************************************/
void USBD_RemoteWakeup(void)
{
  USB->CSR |= GENRSM;
  return;
}

/*********************************************************************************************************//**
  * @brief  Read Endpoint0 SETUP data from USB Buffer.
  * @param  pBuffer: Buffer for save SETUP data
  * @retval None
  ***********************************************************************************************************/
void USBD_ReadSETUPData(u32 *pBuffer)
{
  u32 *pSrc = (u32 *)USB_SRAM_BASE;

  *pBuffer = *pSrc;
  *(pBuffer + 1) = *(pSrc + 1);
  return;
}

/*********************************************************************************************************//**
  * @brief  Set USB Device address.
  * @param  address: USB address which specified by Host
  * @retval None
  ***********************************************************************************************************/
void USBD_SetAddress(u32 address)
{
  USB->CSR   = ADRSET;
  USB->DEVAR = address;
  return;
}

/*********************************************************************************************************//**
  * @brief  Enable USB Device interrupt.
  * @param  INTFlag: USB Device global interrupt flag
  *         @arg UGIE  | SOFIE  | URSTIE | RSMIE  | SUSPIE | ESOFIE
  *              EP0IE | EP1IE  | EP2IE  | EP3IE  | EP4IE  | EP5IE  | EP6IE  | EP7IE
  * @retval None
  ***********************************************************************************************************/
void USBD_EnableINT(u32 INTFlag)
{
  USB->IER |= INTFlag;
  return;
}

/*********************************************************************************************************//**
  * @brief  Disable USB Device interrupt.
  * @param  INTFlag: USB Device global interrupt flag
  *         @arg UGIE  | SOFIE  | URSTIE | RSMIE  | SUSPIE | ESOFIE
  *              EP0IE | EP1IE  | EP2IE  | EP3IE  | EP4IE  | EP5IE  | EP6IE  | EP7IE
  * @retval None
  ***********************************************************************************************************/
void USBD_DisableINT(u32 INTFlag)
{
  USB->IER &= (~INTFlag);
  return;
}

/*********************************************************************************************************//**
  * @brief  Get active USB Device interrupt flag.
  * @retval USB ISR Flag
  ***********************************************************************************************************/
u32 USBD_GetINT(void)
{
  u32 IER = USB->IER;
  return (USB->ISR & IER);
}

/*********************************************************************************************************//**
  * @brief  Clear USB Device interrupt flag.
  * @param  INTFlag: USB Device global interrupt flag
  *         @arg SOFIF | URSTIF | RSMIF | SUSPIF | ESOFIF
  *              EP0IF | EP1IF  | EP2IF | EP3IF  | EP4IF | EP5IF | EP6IF | EP7IF
  * @retval None
  ***********************************************************************************************************/
void USBD_ClearINT(u32 INTFlag)
{
  USB->ISR = INTFlag;
  return;
}

/*********************************************************************************************************//**
  * @brief  Get USB Endpoint number by interrupt flag.
  * @param  INTFlag: USB Device global interrupt flag
  *         @arg SOFIF | URSTIF | RSMIF | SUSPIF | ESOFIF
  *              EP0IF | EP1IF  | EP2IF | EP3IF  | EP4IF | EP5IF | EP6IF | EP7IF
  * @retval USB Endpoint number from USBD_EPT1 ~ USBD_EPT7
  ***********************************************************************************************************/
USBD_EPTn_Enum USBD_GetEPTnINTNumber(u32 INTFlag)
{
  s32 i;
  for (i = MAX_EP_NUM - 1; i > 0; i--)
  {
    if ((INTFlag >> (i + ISR_EPn_OFFSET)) & SET)
    {
      return (USBD_EPTn_Enum)i;
    }
  }

  return USBD_NOEPT;
}

/*********************************************************************************************************//**
  * @brief  USB Device Peripheral initialization for Endpoint.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pDriver: USB initialization structure
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTInit(USBD_EPTn_Enum EPTn, u32 *pDriver)
{
  USBD_Driver_TypeDef *pDrv = (USBD_Driver_TypeDef *)pDriver;
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);

  USBEPn->CFGR = pDrv->ept[EPTn].CFGR.word;
  USBEPn->IER  = pDrv->ept[EPTn].IER;

  USBEPn->ISR = 0xFFFFFFFF;

