Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_usbd.c
  USBD_EPTReset(EPTn);

  return;
}

/*********************************************************************************************************//**
  * @brief  Reset Endpoint Status.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTReset(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  USBEPn->CSR = (USBEPn->CSR) & (DTGTX | DTGRX | NAKRX);
  return;
}

/*********************************************************************************************************//**
  * @brief  Enable Interrupt for Endpoint.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  INTFlag: Interrupt flag
  *         @arg OTRXIE | ODRXIE | ODOVIE | ITRXIE | IDTXIE | NAKIE | STLIE | UERIE |
  *              STRXIE | SDRXIE | SDERIE | ZLRXIE
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTEnableINT(USBD_EPTn_Enum EPTn, u32 INTFlag)
{
  _USBD_GetEPTnAddr(EPTn)->IER = INTFlag;
  return;
}

/*********************************************************************************************************//**
  * @brief  Get active USB Device Endpoint interrupt.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval USB Endpoint ISR Flag
  ***********************************************************************************************************/
u32 USBD_EPTGetINT(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  u32 IER = USBEPn->IER;
  return (USBEPn->ISR & IER);
}

/*********************************************************************************************************//**
  * @brief  Clear Interrupt for Endpoint.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  INTFlag: Interrupt flag
  *         @arg OTRXIF | ODRXIF | ODOVIF | ITRXIF | IDTXIF | NAKIF | STLIF | UERIF |
  *              STRXIF | SDRXIF | SDERIF | ZLRXIF
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTClearINT(USBD_EPTn_Enum EPTn, u32 INTFlag)
{
  _USBD_GetEPTnAddr(EPTn)->ISR = INTFlag;
  return;
}

/*********************************************************************************************************//**
  * @brief  Get Endpoint n Halt status (STLTX or STLRX).
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval Endpoint Halt Status (1: Endpoint is Halt, 0: Endpoint is not Halt)
  ***********************************************************************************************************/
u32 USBD_EPTGetHalt(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  USBD_EPTCFGR_Bit *CFGR = (USBD_EPTCFGR_Bit *)(&(USBEPn->CFGR));
  if (CFGR->EPDIR == EPDIR_IN)
  {
    return (((USBEPn->CSR) & STLTX) ? 1 : 0);
  }
  else
  {
    return (((USBEPn->CSR) & STLRX) ? 1 : 0);
  }
}

/*********************************************************************************************************//**
  * @brief  Send STALL on Endpoint n.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTSendSTALL(USBD_EPTn_Enum EPTn)
{
  _USBD_GetEPTnAddr(EPTn)->CSR = STLTX;
  return;
}

/*********************************************************************************************************//**
  * @brief  Set Endpoint n Halt status (STLTX or STLRX).
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTSetHalt(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);

#if 1
  /* Clean STLIF flag, for USBD_EPTWaitSTALLSent function                                                   */
  USBEPn->ISR = STLIF;
  USBEPn->CSR = (~(USBEPn->CSR)) & (STLTX | STLRX);
#else
  USBD_EPTCFGR_Bit *CFGR = (USBD_EPTCFGR_Bit *)(&(USBEPn->CFGR));
  if (CFGR->EPDIR == EPDIR_IN)
  {
    /* Clean STLIF flag, for USBD_EPTWaitSTALLSent function                                                 */
    USBEPn->ISR = STLIF;
    /* Set only when STLTX = 0                                                                              */
    USBEPn->CSR = (~(USBEPn->CSR)) & STLTX;
  }
  else
  {
    /* Set only when STLRX = 0                                                                              */
    USBEPn->CSR = (~(USBEPn->CSR)) & STLRX;
  }
#endif

  return;
}

/*********************************************************************************************************//**
  * @brief  Clear Endpoint n Halt status (STLTX or STLRX).
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTClearHalt(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);

#if 1
  USBEPn->CSR = (USBEPn->CSR) & (STLTX | STLRX);
#else
  USBD_EPTCFGR_Bit *CFGR = (USBD_EPTCFGR_Bit *)(&(USBEPn->CFGR));
  if (CFGR->EPDIR == EPDIR_IN)
  {
    /* Clear only when STLTX = 1                                                                            */
    USBEPn->CSR = (USBEPn->CSR) & STLTX;
  }
  else
  {
    /* Clear only when STLRX = 1                                                                            */
    USBEPn->CSR = (USBEPn->CSR) & STLRX;
  }
#endif

  return;
}

/*********************************************************************************************************//**
  * @brief  Wait until STALL transmission is finished
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTWaitSTALLSent(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  USBD_EPTCFGR_Bit *CFGR = (USBD_EPTCFGR_Bit *)(&(USBEPn->CFGR));
  u32 uSTALLState = (CFGR->EPDIR == EPDIR_IN) ? ((USBEPn->CSR) & STLTX) : ((USBEPn->CSR) & STLRX);

  if (uSTALLState)
  {
    while ((USBEPn->ISR & STLIF) == 0);
  }

  return;
}

