Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_usbd.c
/*********************************************************************************************************//**
  * @brief  Clear Endpoint n Data toggle bit (DTGTX or DTGRX).
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval None
  ***********************************************************************************************************/
void USBD_EPTClearDTG(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);

#if 1
  USBEPn->CSR = (USBEPn->CSR) & (DTGTX | DTGRX);
#else
  USBD_EPTCFGR_Bit *CFGR = (USBD_EPTCFGR_Bit *)(&(USBEPn->CFGR));
  if (CFGR->EPDIR == EPDIR_IN)
  {
    /* Clear only when DTGTX = 1                                                                            */
    USBEPn->CSR = (USBEPn->CSR) & DTGTX;
  }
  else
  {
    /* Clear only when DTGRX = 1                                                                            */
    USBEPn->CSR = (USBEPn->CSR) & DTGRX;
  }
#endif
  return;
}

/*********************************************************************************************************//**
  * @brief  Get Endpoint n buffer 0 address.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval USB Endpoint buffer 0 address
  ***********************************************************************************************************/
u32 USBD_EPTGetBuffer0Addr(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  return (USB_SRAM_BASE + (USBEPn->CFGR & EPBUFA_MASK));
}

/*********************************************************************************************************//**
  * @brief  Get Endpoint n buffer 1 address.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval USB Endpoint buffer 1 address
  ***********************************************************************************************************/
u32 USBD_EPTGetBuffer1Addr(USBD_EPTn_Enum EPTn)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  return (USB_SRAM_BASE + (USBEPn->CFGR & EPBUFA_MASK) + USBD_EPTGetBufferLen(EPTn));
}

/*********************************************************************************************************//**
  * @brief  Get Endpoint n buffer length.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval USB Endpoint buffer length
  ***********************************************************************************************************/
u32 USBD_EPTGetBufferLen(USBD_EPTn_Enum EPTn)
{
  return ((_USBD_GetEPTnAddr(EPTn)->CFGR & EPLEN_MASK) >> 10);
}

/*********************************************************************************************************//**
  * @brief  Get Endpoint n Transfer Count.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  type: USBD_TCR_0 or USBD_TCR_1
  * @retval Endpoint Transfer Count
  ***********************************************************************************************************/
u32 USBD_EPTGetTransferCount(USBD_EPTn_Enum EPTn, USBD_TCR_Enum type)
{
  return (((_USBD_GetEPTnAddr(EPTn)->TCR) >> type) & TCR_MASK);
}

/*********************************************************************************************************//**
  * @brief  Write IN Data from User buffer to USB buffer.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pFrom: Source buffer
  * @param  len: Length for write IN data
  * @retval Total length writen by this function
  ***********************************************************************************************************/
u32 USBD_EPTWriteINData(USBD_EPTn_Enum EPTn, u32 *pFrom, u32 len)
{
  u32 bufferlen = USBD_EPTGetBufferLen(EPTn);
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  u32 EPTnLen;
  u32 *pTo;

  EPTnLen = (EPTn == USBD_EPT0) ? USBD_EPTGetTransferCount(EPTn, USBD_CNTIN):USBD_EPTGetTransferCount(EPTn, USBD_CNTB0);

  if (len <= bufferlen && EPTnLen == 0)
  {
    pTo = (u32 *)USBD_EPTGetBuffer0Addr(EPTn);
    _USBD_CopyMemory(pFrom, pTo, ByteLen2WordLen(len));
    USBEPn->TCR = len;
    USBEPn->CSR = NAKTX;
    return len;
  }
  else
  {
    return 0;
  }
}

/*********************************************************************************************************//**
  * @brief  Read OUT Data from USB buffer to User buffer.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pTo: Destination memory
  * @param  len: Length for read OUT data, set as 0 for discard current OUT data in the USB buffer
  * @retval Total length read by this function
  ***********************************************************************************************************/
u32 USBD_EPTReadOUTData(USBD_EPTn_Enum EPTn, u32 *pTo, u32 len)
{
  USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(EPTn);
  u32 EPTnLen = 0;

  if (len != 0)
  {
    EPTnLen = USBD_EPTReadMemory(EPTn, pTo, len);
  }

  if (EPTnLen != 0 || len == 0)
  {
    USBEPn->CSR = (USBEPn->CSR & NAKRX);
  }

  return EPTnLen;
}

/*********************************************************************************************************//**
  * @brief  Read memory from endpoint buffer.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pTo: Destination buffer
  * @param  len: Length for read OUT data
  * @retval Total length read by this function
  ***********************************************************************************************************/
u32 USBD_EPTReadMemory(USBD_EPTn_Enum EPTn, u32 *pTo, u32 len)
{
  u32 EPTnLen = 0;
  u32 *pFrom;

  EPTnLen = (EPTn == USBD_EPT0) ? USBD_EPTGetTransferCount(EPTn, USBD_CNTOUT):USBD_EPTGetTransferCount(EPTn, USBD_CNTB0);

  if (EPTnLen <= len)
  {
    pFrom = (EPTn == USBD_EPT0) ? (u32 *)USBD_EPTGetBuffer1Addr(EPTn):(u32 *)USBD_EPTGetBuffer0Addr(EPTn);
    _USBD_CopyMemory(pFrom, pTo, ByteLen2WordLen(EPTnLen));
  }

  return EPTnLen;
}

/**
  * @}
  */
/* End of USBDevice_Global_Function group                                                                   */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_Function USB Device private functions
  * @{
  */

/*********************************************************************************************************//**
  * @brief  Copy 32 bits memory from pFrom to pTo.
  * @param  pFrom: Source buffer
  * @param  pTo: Destination buffer
  * @param  len: Copy length
  * @retval None
  ***********************************************************************************************************/
static void _USBD_CopyMemory(u32 *pFrom, u32 *pTo, u32 len)
{
  s32 i;
  for (i = len - 1; i >= 0; i--)
  {
    pTo[i] = pFrom[i];
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Convent USBD_EPTn_Enum to USBEP_TypeDef.
  * @param  EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval USBEP0 ~ USBEP7
  ***********************************************************************************************************/
static USBEP_TypeDef * _USBD_GetEPTnAddr(USBD_EPTn_Enum EPTn)
{
  return ((USBEP_TypeDef *)(USBEP0 + EPTn));
}

/**
  * @}
  */
/* End of USBDevice_Private_Function group                                                                  */

/**
  * @}
  */
/* End of USBDevice group                                                                                   */

/**
  * @}
  */
/* End of HT32F175x_275x_Peripheral_Driver group                                                            */
